/* 
  Localizable.strings
  Tenorshare4DDiG

  Created by Tenorshare on 2022/7/27.
  
*/

"language" = "th";
"languageGA" = "th";

/*******NSMenu title*****/
//MARK: - 第一版
"About %@" = "เกี่ยวกับ %@";
"Buy Now" = "ซื้อตอนนี้";
"BUY NOW" = "ซื้อตอนนี้";
"Register" = "ลงทะเบียน";
"Check for Updates" = "ตรวจสอบการอัปเดต";
"Service" = "บริการ";
"Hide %@" = "ซ่อน %@";
"Quit %@" = "ออก %@";
"Hide Other" = "ซ่อนอื่นๆ";
"Show All" = "แสดงทั้งหมด";
"Edit" = "แก้ไข";
"Undo" = "ยกเลิกการทำ";
"Redo" = "ทำซ้ำ";
"Cut" = "ตัด";
"Copy" = "คัดลอก";
"Paste" = "วาง";
"Delete" = "ลบ";
"Select All" = "เลือกทั้งหมด";
"Window" = "หน้าต่าง";
"Minimize" = "ย่อ";
"Zoom" = "ซูม";
"Enter Full Screen" = "เข้าโหมดเต็มจอ";
"Bring All to Front" = "นำทั้งหมดมาที่ด้านหน้า";
"Help" = "การช่วยเหลือ";
"Guide" = "แนวทาง";
"Feedback" = "ข้อเสนอแนะ";
"Support" = "การสนับสนุน";
"Open Log" = "เปิดบันทึก";
"OK" = "ตกลง";
"Contact us" = "ติดต่อเรา";
"Yes" = "ใช่";
"No" = "ไม่";
"Open" = "เปิด";
"Refresh" = "รีเฟรช";
"Tenorshare %@ %@ Build Date %@" = "Tenorshare %@ %@ วันที่สร้าง %@";
"%@ %@ Build Date %@" = "%@ %@ วันที่สร้าง %@";
"All Rights Reserved." = "สงวนลิขสิทธิ์";
"Tree View" = "มุมมองต้นไม้";
"File View" = "มุมมองไฟล์";
"Please select the file you want to recover." = "โปรดเลือกไฟล์ที่คุณต้องการกู้คืน";
"Saving files to the partition where you lost them will reduce the chances of a successful recovery. It's recommended to recover the files to a removable disk." = "การบันทึกไฟล์ไปยังพาร์ติชั่นที่คุณทำหายจะลดโอกาสในการกู้คืนสำเร็จ ขอแนะนำให้กู้คืนไฟล์ไปยังดิสก์ที่ถอดได้";
"Saving files to the partition where you lost them will reduce the chances of a successful recovery. Are you sure you want to continue?" = "การบันทึกไฟล์ไปยังพาร์ติชั่นที่คุณทำหายจะลดโอกาสในการกู้คืนสำเร็จ คุณต้องการที่จะดำเนินการต่อหรือไม่?";
"Not enough space available on the disk. Additional %@ space is needed to recover these files." = "มีพื้นที่บนดิสก์ไม่เพียงพอ ต้องการพื้นที่อีก %@ เพื่อกู้คืนไฟล์เหล่านี้";
"Recovering: %@" = "กำลังกู้คืน: %@";
"Please wait..." = "โปรดรอ...";
"Recovery completed!" = "การกู้คืนเสร็จสิ้นแล้ว!";
"Click Open button to check the recovered files." = "คลิกปุ่ม เปิด เพื่อตรวจสอบไฟล์ที่กู้คืน";
"Are you sure you want to stop recovery?" = "คุณแน่ใจหรือไม่ว่าต้องการหยุดการกู้คืน?";
"Failed to save data to the target disk. Please choose another disk and try again." = "การบันทึกข้อมูลไปยังดิสก์เป้าหมายล้มเหลว โปรดเลือกดิสก์อื่นแล้วลองอีกครั้ง";
"Your disk is disconnected. Please reinsert and try again." = "ดิสก์ของคุณถูกตัดการเชื่อมต่อ โปรดเสียบใหม่แล้วลองอีกครั้ง";
"Save failed due to disconnection of the target disk. Please reinsert and try again." = "การบันทึกล้มเหลวเนื่องจากถูกการเชื่อมต่อกับดิสก์เป้าหมาย โปรดเสียบใหม่แล้วลองอีกครั้ง";
"Note:" = "หมายเหตุ:";
"Please do not save the recovered files to the partition where you lost them. This may cause permanent data loss." = "โปรดอย่าบันทึกไฟล์ที่กู้คืนไปยังพาร์ติชั่นที่คุณทำหาย สิ่งนี้อาจทำให้ข้อมูลสูญหายถาวร";
"All Files" = "ไฟล์ทั้งหมด";
"Photo" = "รูปภาพ";
"Audio" = "เสียง";
"Video" = "วิดีโอ";
"Document" = "เอกสาร";
"Email" = "อีเมล";
"Webfile" = "เว็บไฟล์";
"Archive" = "เก็บถาวร";
"No Extension" = "ไม่มีส่วนขยาย";
"Others" = "อื่นๆ";
"Trash" = "ขยะ";
"Lost Location" = "ตำแหน่งที่หาย";
"More" = "เพิ่มเติม";
"The scan result will not be saved if you close the program now. Are you sure you want to close?" = "ผลการสแกนจะไม่ถูกบันทึกหากคุณปิดโปรแกรมตอนนี้ คุณแน่ใจหรือไม่ว่าต้องการปิด?";
"YES" = "ใช่";
"No" = "ไม่";
"Are you sure you want to stop scanning?" = "คุณแน่ใจหรือไม่ว่าต้องการหยุดสแกน?";
"The scan result will not be saved now. Are you sure you want to return Home?" = "ผลลัพธ์การสแกนจะไม่ถูกบันทึกในตอนนี้ คุณแน่ใจหรือไม่ว่าต้องการกลับไปที่หน้าหลัก?";
"Continue" = "ดำเนินการต่อ";
"Pause" = "หยุดชั่วคราว";
"Time remaining: %@" = "เวลาที่เหลือ: %@";
"Stop" = "หยุด";
"Loading search content, please wait…" = "กำลังโหลดเนื้อหาการค้นหา โปรดรอ…";
"Back" = "ย้อนกลับ";
"Scanning… (%.1f%%)" = "กำลังสแกน… (%.1f%%)";
"Scanning…" = "กำลังสแกน…";
"%li files found (%.1f%%)" = "%li ไฟล์ที่พบ (%.1f%%)";
"%li items found, %@" = "%li ไฟล์ที่พบ, %@";
"Selected: %li files, %@" = "ที่เลือก: %li ไฟล์, %@";
"Home" = "หน้าหลัก";
"Recover" = "กู้คืน";
"Search" = "ค้นหา";
"Scan completed!" = "การสแกนเสร็จสิ้น!";
"Loading content, please wait..." = "กำลังโหลดเนื้อหา โปรดรอ...";
"Unlock" = "ปลดล็อก";
"Password hint: %@" = "คำใบ้รหัสผ่าน: %@";
"Password:" = "รหัสผ่าน:";
"Please enter a password to unlock the disk \%@\." = "โปรดกรอกรหัสผ่านเพื่อปลดล็อกดิสก์ \%@\"";
"Wrong password" = "รหัสผ่านไม่ถูกต้อง";
"Cancel" = "ยกเลิก";
"Reading data from the disk, please wait…" = "กำลังอ่านข้อมูลจากดิสก์ โปรดรอ…";
"Select a location to start data recovery" = "เลือกตำแหน่งเพื่อเริ่มการกู้คืนข้อมูล";
"Hard Drives" = "ฮาร์ดไดร์ฟ";
"External Drives" = "ไดร์ฟพกพา";
"%@ free of %@" = "ว่าง %@ จาก %@";
"Other Location" = "ตำแหน่งอื่น";
"The Whole Computer" = "คอมพิวเตอร์ทั้งเครื่อง";
"UltData" = "UltData";
"To recover data from iOS devices, please switch to UltData-iOS" = "หากต้องการกู้คืนข้อมูลจากอุปกรณ์​iOS โปรดสลับไปที่ UltData-iOS";
"UltFone iOS Data Recovery" = "การกู้คืนข้อมูล UltFone iOS";
"To recover data from iOS devices, please switch to UltFone iOS Data Recovery" = "หากต้องการกู้คืนจากอุปกรณ์ iOS โปรดสลับไปที่การกู้คืนข้อมูล UltFone iOS";
"Scan" = "สแกน";
"Untitled" = "ไม่มีชื่อ";
"The selected external drive is not available or uninstalled, please reinsert and try again." = "ไดร์ฟพกพาที่เลือกไม่พร้อมใช้งานหรือถอนการติดตั้งอยู่ โปรดเสียบใหม่แล้วลองอีกครั้ง";
"The selected File System is currently not supported. Please select other disks for data recovery." = "ระบบไฟล์ที่เลือกไม่ได้รับการรองรับในปัจจุบัน โปรดเลือกดิสก์อื่นสำหรับการกู้คืนข้อมูล";
"To recover data from the \macOS High Sierra\ and later systems, you need to disable System Integrity Protection by following the steps below in advance." = "หากต้องการกู้คืนข้อมูลจาก \macOS High Sierra\ และระบบที่รุ่นใหม่กว่า คุณจำเป็นต้องปิดใช้งานการป้องกันความสมบูรณ์ของระบบด้วยการทำตามขั้นตอนดังต่อไปนี้ล่วงหน้า";
"Step 1." = "ขั้นตอนที่ 1";
"Hold down Command + R on the keyboard immediately when you restart the Mac. Keep holding until the Mac finishes startup process, and you will see the utilities window." = "กดปุ่ม Command + R ค้างที่คีย์บอร์ดทันทีที่คุณรีสตาร์ท Mac กดค้างจนกว่า Mac จะเสร็จสิ้นกระบวนการเริ่มต้น และคุณจะเห็นหน้าต่างยูทิลิตี้";
"Command + R" = "Command + R";
"Note: If you are using iMac/iMac Pro, please use wired keyboard." = "หมายเหตุ: หากคุณใช้ iMac/iMac Pro โปรดใช้คีย์บอร์ดแบบสาย";
"Step 2." = "ขั้นตอนที่ 2";
"Open Terminal from the Utilities menu." = "เปิดเทอร์มินัลจากเมนูยูทิลิตี้";
"Terminal" = "เทอร์มินัล";
"Utilities" = "ยูทิลิตี้";
"Step 3." = "ขั้นตอนที่ 3";
"Type the following command and hit Enter key to disable SIP. Then restart your Mac again." = "พิมพ์คำสั่งดังต่อไปนี้แล้วกดปุ่ม Enter เพื่อปิดใช้งาน SIP จากนั้นรีสตาร์ท Mac ของคุณอีกครั้ง";
"Enter" = "กรอก";
"Your Mac will restart during this process. Please take a photo with your phone and save steps." = "Mac ของคุณจะรีสตาร์ทในระหว่างกระบวนการนี้ โปรดถ่ายภาพด้วยโทรศัพท์ของคุณและบันทึกขั้นตอน";
"Name" = "ชื่อ";
"Created Date" = "วันที่สร้าง";
"Modified Date" = "วันที่แก้ไข";
"Path" = "พาธ";
"Type" = "ประเภท";
"Size" = "ขนาด";
"Files not found!" = "ไม่พบไฟล์!";
"folder" = "โฟลเดอร์";
"file" = "ไฟล์";
"PREV" = "ก่อนหน้า";
"NEXT" = "ถัดไป";
"GO TO:" = "ไปที่:";
"Didn't find the missing data? Try using Deep Scan." = "ไม่พบข้อมูลที่หายไปเหรอ? ลองใช้การสแกนละเอียด";
"Deep Scan" = "สแกนละเอียด";
"Previous Scan Results" = "ผลลัพธ์การสแกนก่อนหน้า";
"Returning to the last scan result requires stopping the current scan. Are you sure you want to stop?" = "การกลับไปที่ผลลัพธ์การสแกนก่อนหน้าจำเป็นต้องหยุดการสแกนปัจจุบันก่อน คุณแน่ใจหรือไม่ว่าต้องการหยุด?";
"Stop" = "หยุด";
"Cancel" = "ยกเลิก";
"Deep scan completed!" = "การสแกนละเอียดเสร็จสิ้น!";
"OK" = "ตกลง";
"Loading content, please wait…" = "กำลังโหลดเนื้อหา โปรดรอ…";
"View Deep Scan Results" = "ดูผลลัพธ์การสแกนละเอียด";
"List View" = "มุมมองรายการ";
"Thumbnail" = "ภาพขนาดย่อ";
"Preview Pane" = "พรีวิวหน้าต่าง";
"Preview" = "พรีวิว";
"This format file does not support to preview." = "ไฟล์รูปแบบนี้ไม่รองรับการพรีวิว";
"This file may be corrupt and can't be previewed." = "ไฟล์นี้อาจเสียหายและไม่สามารถดูพรีวิวได้";
"File size that exceeds 8 MB does not support to preview." = "ขนาดไฟล์ที่มากกว่า 8 MB ไม่รองรับการพรีวิว";
"The lost data may be damaged at any time and cannot be recovered. It is recommended to recover them earlier for higher recovery rate." = "ไฟล์ที่สูญหายอาจได้รับความเสียหายได้ทุกเมื่อและไม่สามารถกู้คืนได้ ขอแนะนำให้กู้คืนก่อนเพื่อให้อัตราการกู้คืนสูงขึ้น";
"Buy now to save 70%" = "ซื้อตอนนี้เพื่อประหยัด 70%";
"Unlimited Data Recovery" = "การกู้คืนข้อมูลแบบไม่จำกัด";
"Recover your valuable data easily and quickly." = "กู้คืนข้อมูลที่มีค่าของคุณอย่างรวดเร็วและง่ายดาย";
"Multiple File Types" = "ประเภทไฟล์ที่หลากหลาย";
"Recover 550+ types of files from hard drive, memory card, etc." = "กู้คืนไฟล์ 550+ ประเภทจากฮาร์ดไดร์ฟ เมมโมรี่การ์ด ฯลฯ";
"Professional Support" = "การสนับสนุนระดับมืออาชีพ";
"Provide professional and quality customer support." = "ให้การสนับสนุนลูกค้าที่มีคุณภาพระดับมืออาชีพ";
"Free Update" = "การอัปเดตฟรี";
"Enjoy free update within license validity." = "เพลิดเพลินกับการอัปเดตฟรีภายในอายุใบอนุญาต";
"Already have a registration code? Register now" = "มีรหัสลงทะเบียนอยู่แล้วเหรอ? ลงทะเบียนตอนนี้เลย";
"Register now" = "ลงทะเบียนตอนนี้";
"To recover data from crashed computer, please click here." = "หากต้องการกู้คืนข้อมูลจากคอมพิวเตอร์ที่แคลช โปรดคลิกที่นี่";
"click here" = "คลิกที่นี่";
"Downloading boot system image, please wait…" = "กำลังดาวน์โหลดอิมเมจระบบบูท โปรดรอ…";
"When downloading the system image, please do not operate the disk or eject it." = "เมื่อดาวน์โหลดอิมเมจระบบ โปรดอย่าใช้ดิสก์หรือถอดออก";
"Are you sure you want to stop downloading the boot system image?" = "คุณแน่ใจหรือไม่ว่าต้องการหยุดดาวน์โหลดภาพระบบบูท?";
"Creating a bootable drive using an SD card is not supported. Please use another storage device to create the bootable drive." = "ไม่รองรับการสร้างไดร์ฟที่บูทได้โดยใช้เอสดีการ์ด โปรดใช้อุปกรณ์จัดเก็บอื่นเพื่อสร้างไดร์ฟที่บูทได้";
"Recover from Crashed System" = "กู้คืนจากระบบแคลช";
"Support to recover files from crashed system." = "รองรับการกู้คืนไฟล์จากระบบแคลช";
"Recover Data from Crashed System" = "กู้คืนข้อมูลจากระบบที่แคลช";
"Recover lost files from crashed computer" = "กู้คืนไฟล์ที่สูญหายจากคอมพิวเตอร์ที่แคลช";
"To recover data from iOS devices, please switch to iOS Data Recovery" = "หากต้องการกู้คืนข้อมูลจากอุปกรณ์ iOS โปรดวลับไปที่การกู้คืนข้อมูล iOS";
"Creating bootable drive…" = "กำลังสร้างไดร์ฟที่บูทได้…";
"The bootable drive is created successfully!" = "สร้างไดร์ฟที่บูทได้สำเร็จแล้ว!";
"Please select a USB flash drive/external hard drive to create a bootable drive." = "โปรดเลือกแฟลชไดร์ฟยูเอสบี/ฮาร์ดไดร์ฟพกพาเพื่อสร้างไดร์ฟที่บูทได้";
"Insert a USB flash drive/external hard drive to create a bootable drive, and then recover data from crashed system by the bootable drive." = "เสียบแฟลชไดร์ฟยูเอสบี/ฮาร์ดไดร์ฟพกพาเพื่อสร้างไดร์ฟที่บูทได้ จากนั้นกู้คืนข้อมูลจากระบบที่แคลชด้วยไดร์ฟที่บูทได้";
"Bootable drive:" = "ไดร์ฟที่บูทได้:";
"Refresh" = "รีเฟรช";
"Note: Creating a bootable drive will format all data in the selected disk. Please back up your important data in advance." = "หมายเหตุ: การสร้างไดร์ฟที่บูทได้จะฟอร์แมทข้อมูลทั้งหมดของดิสก์ที่เลือก โปรดสำรองข้อมูลสำคัญของคุณล่วงหน้า";
"Return" = "ย้อนกลับ";
"Start" = "เริ่ม";
"OK" = "ตกลง";
"Creating a bootable drive will format all data in the selected disk. Are you sure you want to continue?" = "การสร้างไดร์ฟที่บูทได้จะฟอร์แมทข้อมูลทั้งหมดของดิสก์ที่เลือก คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?";
"Cancel" = "ยกเลิก";
"The total disk space is less than 2GB. Please use a larger USB drive/external hard drive to create the bootable drive." = "พื้นที่ดิสก์ทั้งหมดเหลือน้อยกว่า 2GB โปรดใช้ไดร์ฟยูเอสบี/ฮาร์ดไดร์ฟพกพาที่ขนาดใหญ่ขึ้นเพื่อสร้างไดร์ฟที่บูทได้";
"The local disk space is less than 2GB and the boot system image cannot be downloaded. Please free up some disk space before downloading." = "พื้นที่ดิสก์ในเครื่องน้อยกว่า 2GB และไม่สามารถดาวน์โหลดอิมเมจระบบบูทได้ โปรดเคลียร์พื้นที่ในดิสก์ก่อนดาวน์โหลด";
"Formatting the bootable drive, please wait…" = "กำลังฟอร์แมทไดร์ฟที่บูทได้ โปรดรอ…";
"When formatting the bootable drive, please do not operate or eject it." = "เมื่อฟอร์แมทไดร์ฟที่บูทได้ โปรดอย่าใช้งานหรือถอดออก";
"To avoid the burned disk be damaged, please be patient and wait for the burn to complete." = "หากต้องการหลีกเลี่ยงดิสก์ที่เบิร์นไม่ให้เสียหาย โปรดตั้งใจรอให้เบิร์นเสร็จสิ้นก่อน";
"Creating bootable drive, please wait…" = "กำลังสร้างไดร์ฟที่บูทได้ โปรดรอ…";
"When creating the bootable drive, please do not operate the disk or eject it." = "เมื่อกำลังสร้างไดร์ฟที่บูทได้ โปรดอย่าใช้งานดิสก์หรือถอดออก";
"Follow the steps below to use the bootable drive to boot a Mac that cannot be turned on." = "ทำตามขั้นตอนดังต่อไปนี้ด้านล่างเพื่อใช้ไดร์ฟที่บูทได้เพื่อบูท Mac ที่เปิดไม่ติด";
"bootable drive" = "ไดร์ฟที่บูทไม่ได้";
"cannot be turned on" = "เปิดไม่ติด";
"black screen" = "จอดำ";
"Option key" = "ปุ่ม Option";
"%@ bootable drive" = "%@ ไดร์ฟที่บูทได้";
"Step 1: Insert the bootable drive into a Mac that cannot be turned on." = "ขั้นตอนที่ 1: เสียบไดร์ฟที่บูทได้เข้าไปใน Mac ที่เปิดไม่ติด";
"Step 2: Start the computer that cannot be turned on. When the Mac is in a black screen, press and hold the Option key. Release the Option key until you see the bootable drive." = "ขั้นตอนที่ 2: เปิดคอมพิวเตอร์ที่เปิดไม่ติด เมื่อ Mac ขึ้นจอดำ โปรดกดปุ่ม Option ค้างไว้ ปล่อยปุ่ม Option เมื่อคุณเห็นไดร์ฟที่บูทได้";
"Step 3: On the Select bootable drive interface, select the %@ bootable drive." = "ขั้นตอนที่ 3: ในอินเทอร์เฟซการเลือกไดร์ฟที่บูทได้ ให้เลือก %@ ไดร์ฟที่บูทได้";
"here" = "ที่นี่";
"To see the detailed steps, please click here." = "หากต้องการดูขั้นตอนอย่างละเอียด โปรดคลิกที่นี่";
"Bootable drive creation failed!" = "การสร้างไดร์ฟที่บูทได้ล้มเหลว!";
"Contact Us" = "ติดต่อเรา";
"Bootable drive creation failed! Please check if your disk is disconnected. You can click the Retry button or Contact Us." = "การสร้างไดร์ฟที่บูทได้ล้มเหลว! โปรดตรวจสอบว่าดิสก์ของคุณถูกตัดการเชื่อมต่ออยู่หรือไม่ คุณสามารถคลิกที่ปุ่ม ลองอีกครั้ง หรือติดต่อเรา";
"Retry" = "ลองอีกครั้ง";
"Select USB/external hard drive" = "เลือกยูเอสบี/ฮาร์ดไดร์ฟพกพา";
"Completed!" = "เสร็จสิ้น!";
"Format" = "ฟอร์แมท";
"Please enter login password to allow disk access." = "โปรดกรอกรหัสผ่านเข้าสู่ระบบเพื่ออนุญาตให้เข้าถึงดิสก์";
"note:" = "หมายเหตุ:";
"1. If you have not received the registration code or don't know the register E-mail address, please click here to check." = "1. หากคุณไม่ได้รับรหัสลงทะเบียนหรือไม่รู้ที่อยู่อีเมลที่ลงทะเบียนไว้ โปรดคลิกที่นี่เพื่อตรวจสอบ";
"2. For other software or registration issues, please visit support center." = "2. สำหรับปัญหาเรื่องซอฟต์แวร์ อื่นๆ หรือการลงทะเบียน โปรดไปที่ศูนย์การสนับสนุน";
"click here to check" = "คลิกที่นี่เพื่อตรวจสอบ";
"visit support center" = "ไปที่ศูนย์การสนับสนุน";
"To recover data from the \macOS Catalina\ and later systems, Please follow the steps below to allow %@ to access removable volumes" = "หากต้องการกู้คืนข้อมูลจาก \macOS Catalina\ และระบบที่ใหม่กว่า โปรดทำตามขั้นตอนดังต่อไปนี้ด้านล่างเพื่ออนุญาตให้ %@ เข้าถึงวอลลุ่มที่ถอดได้";
"Step 1 :" = "ขั้นตอนที่ 1 :";
"Step 2 :" = "ขั้นตอนที่ 2 :";
"Step 3 :" = "ขั้นตอนที่ 3 :";
"On your Mac, choose Apple menu  > System Preferences, click Security & Privacy." = "บน Mac เลือกเมนู Apple > การตั้งค่าระบบ คลิก ความปลอดภัยและความเป็นส่วนตัว";
"Select the \Removable Volumes\ checkbox below %@." = "ทำเครื่องหมายในช่อง \วอลลุ่มที่ถอดได้\ ด้านล่าง %@";
"Click \Later\ to allow %@ to access removable volumes." = "คลิก \ภายหลัง\ เพื่ออนุญาตให้ %@ เข้าถึงวอลลุ่มที่ถอดได้";
"Settings" = "การตั้งค่า";
"OK" = "ตกลง";
"To create a startup disk in \macOS Catalina\ and later versions, Please follow the steps below to allow %@ to access removable volumes" = "หากต้องการสร้างดิสก์สตาร์ทอัพใน \macOS Catalina\ และระบบที่ใหม่กว่า โปรดทำตามขั้นตอนดังต่อไปนี้ด้านล่างเพื่ออนุญาตให้ %@ เข้าถึงวอลลุ่มที่ถอดได้";
"Sorry. Firmware downloading failed due to insufficient hard disk. Please release enough space (about %@) in your hard disk and then download again." = "ขออภัย การดาวน์โหลดเฟิร์มแวร์ล้มเหลวเนื่องจากฮาร์ดดิสก์มีพื้นที่ไม่เพียงพอ โปรดเคลียร์พื้นที่ให้เพียงพอ space (ประมาณ %@) ในฮาร์ดดิสก์ของคุณจากนั้นดาวน์โหลดอีกครั้ง";
"This file path cannot save the firmware. Please change to the correct one." = "พาธไฟล์นี้ไม่สามารถบันทึกเฟิร์มแวร์ได้ โปรดเปลี่ยนเป็นพาธที่ถูกต้อง";
"Failed to download firmware package! Please check your Internet connection and try again." = "การดาวน์โหลดแพ็กเกจเฟิร์มแวร์ล้มเหลว! โปรดตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณแล้วลองอีกครั้ง";
"Downloading the firmware, please wait…" = "กำลังดาวน์โหลดเฟิร์มแวร์ โปรดรอ…";
"Please make sure the network connection is normal." = "โปรดตรวจสอบให้แน่ใจว่าการเชื่อมต่ออินเทอร์เน็ตปกติ";
"Network Abnormal! Please check your network and try again." = "เครือข่ายผิดปกติ! โปรดตรวจสอบเครือข่ายของคุณแล้วลองอีกครั้ง";
"Try Again" = "ลองอีกครั้ง";
"There is not enough space to download the firmware. Please free up at least 1 GB of free space and try again." = "มีพื้นที่ไม่เพียงพอสำหรับการดาวน์โหลดเฟิร์มแวร์ โปรดเคลียร์พื้นที่ว่างอย่างน้อย 1 GB แล้วลองอีกครั้ง";
"Your Mac is equipped with Apple T2 Security Chip, files under the APFS file system cannot be scanned out." = "Mac ของคุณมีชิปความปลอดภัย Apple T2 ไฟล์ที่อยู่ภายใต้ระบบ APFS จะไม่สามารถสแกนได้";
"Failed to download firmware package! Please check your internet connection and try again." = "การดาวน์โหลดแพ็กเกจเฟิร์มแวร์ล้มเหลว! โปรดตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณแล้วลองอีกครั้ง";
"Fast Scan done! Finding more lost data with Deep Scan..." = "การสแกนแบบรวดเร็วเสร็จสิ้น! กำลังหาข้อมูลที่สูญหายเพิ่มเติมด้วยการสแกนละเอียด...";
"Deep Scanning" = "การสแกนละเอียด";
"Fast Scanning" = "การสแกนแบบรวดเร็ว";
"RAW Files" = "ไฟล์​RAW";
"Tag Files" = "ไฟล์แท็ก";
"Deleted Files" = "ไฟล์ที่ถูกลบ";
"Lost Location" = "ตำแหน่งที่สูญหาย";
"Existing Files" = "ไฟล์ที่มีอยู่";
"Found %li files. More useful tips below for finding files:" = "พบ %li ไฟล์ เคล็ดลับที่มีประโยชน์เพิ่มเติมด้านล่างสำหรับการค้นหาไฟล์:";
"File Path Not Found" = "ไม่พบพาธไฟล์";
"File Name Not Found" = "ไม่พบชื่อไฟล์";
"Tagged Files" = "ไฟล์ที่ถูกแท็ก";
"You may find your accidentally deleted files here." = "คุณอาจพบไฟล์ที่เผลอลบจากที่นี่";
"There are deleted files that lost their original path. You can check file names to see if they are target files." = "มีไฟล์ที่ถูกลบที่สูญเสียพาธดั้งเดิมไป คุณสามารถตรวจสอบชื่อไฟล์เพื่อดูว่าสิ่งเหล่านี้เป็นไฟล์เป้าหมายหรือไม่";
"There are files that lost their original names. You can preview them to see if they are target files." = "มีไฟล์ที่สูญเสียชื่อเดิมไป คุณสามารถดูตัวอย่างเพื่อดูว่าเป็นไฟล์เป้าหมายหรือไม่";
"You may find target files here if you lost them which are not deleted before." = "คุณอาจพบไฟล์เป้าหมายที่นี่หากคุณทำหายโดยที่ไม่เคยลบมาก่อน";
"Lost files without name will be renamed and classified here with corresponding tags." = "ไฟล์ที่สูญหายโดยไม่มีชื่อจะถูกเปลี่ยนชื่อและจัดประเภทที่นี่พร้อมแท็กที่เกี่ยวข้อง";
"Unable to preview. Please recover and save it on your computer for further checking." = "ไม่สามารถพรีวิวได้ โปรดกู้คืนแล้วบันทึกลงบนคอมพิวเตอร์ของคุณสำหรับการตรวจสอบเพิ่มเติม";
"Trying to find more data... You can search and recover your data now." = "กำลังพยายามหาข้อมูลเพิ่มเติม... คุณสามารถค้นหาและกู้คืนข้อมูลได้ในตอนนี้";
"Didn't find the missing files? Try Deep Scan." = "ไม่พบไฟล์ที่หายไปเหรอ? ลองสแกนละเอียดสิ";
"The Deep Scan can scour the device inch by inch to find the deeply buried files, enabling a higher recovery rate." = "การสแกนละเอียดสามารถสแกนอุปกรณ์ได้อย่างละเอียดเพื่อหาไฟล์ที่ฝังลึก ส่งผลให้อัตราการกู้คืนสูงขึ้น";
"Artist" = "ศิลปิน";
"Camera" = "กล้อง";
"The Last Editor" = "ผู้แก้ไขล่าสุด";
"Creation Time" = "เวลาที่สร้าง";
"Modified Time" = "เวลาที่แก้ไข";
"All Time" = "ทุกเวลา";
"Last 24 hours" = "24 ชั่วโมงที่แล้ว";
"Last 7 days" = "7 วันที่แล้ว";
"Last 30 days" = "30 วันที่แล้ว";
"Customize" = "ปรับแต่ง";
"Selected" = "ที่เลือก";
"File Size" = "ขนาดไฟล์";
"All Size" = "ทุกขนาด";
"Improve Chances of Finding Lost Files" = "เพิ่มโอกาสในการหาไฟล์ที่สูญหาย";
"Refer to the \Tagged Files\ and \File Name Not Found\ under the Tree View." = "อ้างอิงกับ \ไฟล์ที่ถูกแท็ก\ และ \ไม่พบชื่อไฟล์\ ใต้มุมมองต้นไม้";
"Filter files by File Type, File Size, Date Modified, and more." = "กรองไฟล์ตามประเภทไฟล์ ขนาดไฟล์ วันที่แก้ไข และอื่นๆ";
"Upgrade to Pro Version to Recover Your Valuable Data!" = "อัปเกรดเป็นเวอร์ชันโปรเพื่อกู้คืนข้อมูลที่มีค่าของคุณ!";
"Get the Pro Version to Create a Bootable Drive for Data Recovery!" = "รับเวอร์ชันโปรเพื่อสร้างไดร์ฟที่บูทได้สำหรับการกู้คืนข้อมูล!";
"Free Version" = "เวอร์ชันฟรี";
"Pro Version" = "เวอร์ชันโปร";
"Preview Just a Few Files" = "พรีวิวได้แค่ไม่กี่ไฟล์";
"Preview All Files" = "พรีวิวทุกไฟล์";
"Free Upgrade" = "การอัปเกรดฟรี";
"Recover Data from the Crashed Computer" = "กู้คืนข้อมูลจากคอมพิวเตอร์ที่แคลช";
"Only Allows You to Scan Disks" = "อนุญาตให้คุณสแกนดิสก์เท่านั้น";
"Unlimited Data Recovery" = "การกู้คืนข้อมูลแบบไม่จำกัด";
"Professional Customer Service" = "บริการลูกค้าระดับมืออาชีพ";
"Professional and reliable data recovery solutions" = "โซลูชั่นในการกู้คืนข้อมูลที่น่าเชื่อถือระดับมืออาชีพ";
"Advanced Options" = "ตัวเลือกขั้นสูง";
"Local Drives" = "ไดร์ฟในเครื่อง";
"External Drives" = "ไดร์ฟพกพา";
"Common Location" = "ตำแหน่งที่พบบ่อย";
"Data Recovery" = "การกู้คืนข้อมูล";
"Fast and Safe" = "รวดเร็วและปลอดภัย";
"Failed to read the disk data, please re-plug the external disk." = "ไม่สามารถอ่านข้อมูลในดิสก์ได้ โปรดเสียบดิสก์พกพาใหม่อีกครั้ง";
"Please remove all external disks connected to the computer, and then reinsert the disk that needs data recovery." = "โปรดถอดดิสก์พกพาทั้งหมดที่เชื่อมต่ออยู่กับคอมพิวเตอร์ จากนั้นเสียบดิสก์ที่ต้องการกู้คืนข้อมูล";
"Still have problems? Please contact us." = "ยังมีปัญหาอยู่เหรอ? โปรดติดต่อเรา";
"To recover data from digital camera, please remove the SD card and connect it to computer via card reader." = "หากต้องการกู้คืนข้อมูลจากกล้องดิจิทัล โปรดถอดเอสดีการ์ดแล้วเชื่อมต่อเข้ากับคอมพิวเตอร์ผ่านตัวอ่านการ์ด";
"Found nothing..." = "ไม่พบอะไรเลย...";
"1. Wait for the scan to finish before searching again." = "1. รอให้สแกนเสร็จก่อนค้นหาอีกครั้ง";
"2. Your file is most likely missing the filename. Try searching in this way." = "2. ไฟล์ของคุณอาจจะขาดชื่อไฟล์ ลองค้นหาด้วยวิธีนี้";
"3. Make sure the term you're looking for is spelled correctly." = "3. ตรวจสอบให้แน่ใจว่าคุณสะกดคำที่จะค้นหาอย่างถูกต้อง";
"4. If none of the above methods help, please contact us." = "4. หากวิธีข้างต้นไม่ได้ผล โปรดติดต่อเรา";
"Reading data from the disk，please wait…" = "กำลังอ่านข้อมูลจากดิสก์​ โปรดรอt…";
"Stuck in refreshing status for a long time?" = "ติดอยู่ในสถานะรีเฟรชเป็นเวลานานเหรอ?";
"Effortlessly Recover Data from A Crashed Computer" = "กู้คืนข้อมูลได้ง่ายๆ จากคอมพิวเตอร์แคลช";
"View Files" = "ดูไฟล์";
"It might take a long time to export for some files need repairing..." = "อาจใช้เวลานานในการส่งออกสำหรับบางไฟล์ที่ต้องการซ่อมแซม...";
"contact us" = "ติดต่อเรา";
"in this way" = "ด้วยวิธีนี้";
"Exit App" = "ออกจากแอป";
"Recovered: %li file (%@)" = "กู้คืนแล้ว: %li ไฟล์ (%@)";
"Recovered: %li files (%@)" = "กู้คืนแล้ว: %li ไฟล์ (%@)";
"File Types" = "ประเภทไฟล์";
"File Tags" = "แท็กไฟล์";
"Move your mouse to the icon under Tree View, and you'll learn the explanation of each file category." = "ขยับเมาส์ไปที่ไอคอนใต้มุมมองต้นไม้ แล้วคุณจะได้เรียนรู้เกี่ยวกับคำอธิบายสำหรับแต่ละหมวดหมู่ไฟล์";
"Understood" = "เข้าใจแล้ว";
"Filter" = "ตัวกรอง";
"Reset" = "รีเซ็ต";
"Scan Stopped!" = "หยุดการสแกนแล้ว!";
"Tips:" = "เคล็ดลับ:";
"1. Please replug the external drive or change another drive and then try again." = "1. โปรดเสียบไดร์ฟพกพาใหม่อีกครั้ง หรือเปลี่ยนเป็นไดร์ฟอื่นแล้วลองอีกครั้ง";
"2. Please make sure internet connection is working properly." = "2. โปรดตรวจสอบให้แน่ใจว่าการเชื่อมต่ออินเทอร์เน็ตของคุณทำงานอย่างถูกต้อง";

// V5.0.0
"Get An Extra" = "รับเพิ่ม";
"Coupon Code:" = "รหัสคูปอง:";
"Copy and paste the coupon code at checkout to redeem." = "คัดลอกและวางรหัสคูปองที่หน้าชำระเงินเพื่อรีดีม";
"Copy and Buy Now" = "คัดลอกแล้วซื้อตอนนี้";
"Close Program" = "ปิดโปรแกรม";
"Photo Repair" = "การซ่อมแซมรูปภาพ";
"Video Repair" = "การซ่อมแซมวิดีโอ";
"Repair Damaged Videos in Just Three Steps!" = "ซ่อมแซมวิดีโอที่เสียหายภายในแค่สามขั้นตอน!";
"Repair Damaged Photos in Just Three Steps!" = "ซ่อมแซมรูปภาพที่เสียหายภายในแค่สามขั้นตอน!";
"Import Video" = "นำเข้าวิดีโอ";
"Import Photo" = "นำเข้ารูปภาพ";
"Start Repairing" = "เริ่มการซ่อมแซม";
"Repair Done!" = "ซ่อมแซมสำเร็จแล้ว!";
"Click to Add Photos" = "คลิกเพื่อเพิ่มรูปภาพ";
"Click to Add Videos" = "คลิกเพื่อเพิ่มวิดีโอ";
"%liPhoto Added，%@KB" = "%liรูปภาพที่เพิ่ม, %@";
"%liVideo Added，%@KB" = "%liวิดีโอที่เพิ่ม, %@";
"%liPhotos Added，%@KB" = "%liรูปภาพที่เพิ่ม, %@";
"%liVideos Added，%@KB" = "%liวิดีโอที่เพิ่ม, %@";
"Add Photo" = "เพิ่มรูปภาพ";
"Add Video" = "เพิ่มวิดีโอ";
"Home" = "หน้าหลัก";
"Repair" = "ซ่อมแซม";
"Remove All Image" = "ลบทั้งหมด";
"Remove All Video" = "ลบทั้งหมด";
"This photo can't be repaired." = "วิดีโอนี้ไม่สามารถซ่อมแซมได้";
"This video can't be repaired." = "วิดีโอนี้ไม่สามารถซ่อมแซมได้";
"Select all successfully repaired photos" = "เลือกรูปภาพที่ซ่อมแซมทั้งหมดสำเร็จ";
"Reselect photo to repair" = "เลือกรูปภาพใหม่เพื่อซ่อมแซม";
"Select all successfully repaired videos" = "เลือกวิดีโอที่ซ่อมแซมทั้งหมดสำเร็จ";
"Reselect video to repair" = "เลือกวิดีโอใหม่เพื่อซ่อมแซม";
"We've found several photos from this photo that you might be looking for, and you can preview and export them." = "เราพบหลายรูปภาพจากรูปภาพนี้ที่คุณอาจกำลังมองหา และคุณสามารถพรีวิวและส่งออกได้";
"We've found several videos from this video that you might be looking for, and you can preview and export them." = "เราพบหลายวิดีโอจากวิดีโอนี้ที่คุณอาจกำลังมองหา และคุณสามารถพรีวิวและส่งออกได้";
"Are you sure you want to remove all photos?" = "คุณแน่ใจหรือไม่ว่าต้องการลบรูปภาพทั้งหมด?";
"Are you sure you want to remove all videos?" = "คุณแน่ใจหรือไม่ว่าต้องการลบวิดีโอทั้งหมด?";
"Are you sure you want to return to the home page? The current repair progress will not be saved." = "คุณแน่ใจหรือไม่ว่าต้องการกลับไปที่หน้าหลัก? กระบวนการซ่อมแซมในตอนนี้อาจไม่ได้ถูกบันทึก";
"Are you sure you want to return to the home page? The current repair progress will not be saved." = "คุณแน่ใจหรือไม่ว่าต้องการกลับไปที่หน้าหลัก? กระบวนการซ่อมแซมในตอนนี้อาจไม่ได้ถูกบันทึก";
"Are you sure you want to reselect the video? The current repair progress will not be saved." = "คุณแน่ใจหรือไม่ว่าต้องการเลือกวิดีโอใหม่? กระบวนการซ่อมแซมในตอนนี้อาจไม่ได้ถูกบันทึก";
"Are you sure you want to reselect the photo? The current repair progress will not be saved." = "คุณแน่ใจหรือไม่ว่าต้องการเลือกรูปภาพใหม่? กระบวนการซ่อมแซมในตอนนี้อาจไม่ได้ถูกบันทึก";
"Some videos are already in the repair list and will not be imported repeatedly." = "บางวิดีโออาจอยู่ในรายการซ่อมแซมอยู่แล้ว และจะไม่ได้รับการนำเข้าซ้ำซ้อน";
"Some photos are already in the repair list and will not be imported repeatedly." = "บางรูปภาพอาจอยู่ในรายการซ่อมแซมอยู่แล้ว และจะไม่ได้รับการนำเข้าซ้ำซ้อน";
"The video has been lost, please re-import and try previewing again." = "วิดีโอสูญหาย โปรดนำเข้าใหม่แล้วลองพรีวิวอีกครั้ง";
"The photo has been lost, please re-import and try previewing again." = "รูปภาพสูญหาย โปรดนำเข้าใหม่แล้วลองพรีวิวอีกครั้ง";
"Scanning or recovery cannot continue because the device is disconnected, please re-plug the device and click Continue." = "การสแกนและกู้คืนไม่สามารถดำเนินการต่อได้ เนื่องจากอุปกรณ์ถูกตัดการเชื่อมต่อ โปรดเสียบอุปกรณ์ใหม่แล้วคลิกดำเนินการต่อ";
"Repairing：" = "การซ่อมแซม：";
"Please wait..." = "โปรดรอ...";
"Exporting:" = "การส่งออก:";
"The device has been disconnected, you can try to select data to recover or rescan." = "อุปกรณ์ถูกตัดการเชื่อมต่อ คุณสามารถลองเลือกข้อมูลเพื่อกู้คืนหรือสแกนใหม่";
"Continue" = "ดำเนินการต่อ";
"Retry" = "ลองใหม่";
"Stop" = "หยุด";
"Export Completed!" = "ส่งออกสำเร็จแล้ว!";
"Export: %lifiles(%@)" = "ส่งออก: %liไฟล์(%@)";
"View Exported" = "ดูที่ส่งออก";
"There are still %li videos to export, are you sure you want to stop exporting?" = "ยังมีอยู่ %li วิดีโอที่จะส่งออก คุณแน่ใจหรือไม่ว่าต้องการหยุดส่งออก?";
"There are still %li photos to export, are you sure you want to stop exporting?" = "ยังมีอยู่ %li รูปภาพที่จะส่งออก คุณแน่ใจหรือไม่ว่าต้องการหยุดส่งออก?";
"There are still 1 video to export, are you sure you want to stop exporting?" = "ยังมีอยู่ 1 วิดีโอที่จะส่งออก คุณแน่ใจหรือไม่ว่าต้องการหยุดส่งออก?";
"There are still 1 photo to export, are you sure you want to stop exporting?" = "ยังมีอยู่ 1 รูปภาพที่จะส่งออก คุณแน่ใจหรือไม่ว่าต้องการหยุดส่งออก?";
"Are you sure you want to stop exporting?" = "คุณแน่ใจหรือไม่ว่าต้องการหยุดส่งออก?";
"Upgrade to Pro version to preview files!" = "อัปเกรดเป็นเวอร์ชันโปรเพื่อพรีวิวไฟล์!";
"Upgrade" = "อัปเกรด";
"The unregistered version can only play the first 30s of the audio file, upgrade to the registered version for full playback." = "เวอร์ชันที่ไม่ได้ลงทะเบียนสามารถเล่นได้แค่ 30 วิแรกของไฟล์เสียง อัปเกรดเป็นเวอร์ชันที่ลงทะเบียนสำหรับการเล่นแบบเต็มรูปแบบ";
"The unregistered version can only play the first 10s of the video file, upgrade to the registered version for full playback." = "เวอร์ชันที่ไม่ได้ลงทะเบียนสามารถเล่นได้แค่ 10 วิแรกของไฟล์วิดีโอ อัปเกรดเป็นเวอร์ชันที่ลงทะเบียนสำหรับการเล่นแบบเต็มรูปแบบ";
"Upgrade to Pro Version to Export your Valuable Photos!" = "อัปเกรดเป็นเวอร์ชันโปรเพื่อส่งออกรูปภาพที่มีค่าของคุณ!";
"Upgrade to Pro Version to Export your Valuable Videos!" = "อัปเกรดเป็นเวอร์ชันโปรเพื่อส่งออกวิดีโอที่มีค่าของคุณ!";
"Support for exporting repaired files" = "รองรับการส่งออกไฟล์ที่ซ่อมแซม";

//MARK: - 第二版
"The file can't be previewed, please export it and try to preview it again." = "ไม่สามารถพรีวิวไฟล์ได้ โปรดส่งออกแล้วลองพรีวิวอีกครั้ง";
"The file can't be previewed, please repair it and try to preview it again." = "ไม่สามารถพรีวิวไฟล์ได้ โปรดซ่อมแซมแล้วลองพรีวิวอีกครั้ง";
"Are you sure you want to exit the program? Current repair progress will not be retained." = "คุณแน่ใจหรือไม่ว่าต้องการออกจากโปรแรกม? ความคืบหน้าการซ่อมแซมในปัจจุบันจะไม่สามารถรักษาเอาไว้ได้";
"There are still %li videos waiting to be repaired, are you sure you want to stop the repair?" = "ยังมี %li วิดีโอที่รอซ่อมแซมอยู่ คุณแน่ใจหรือไม่ว่าต้องการหยุดซ่อมแซม?";
"There are still %li photos waiting to be repaired, are you sure you want to stop the repair?" = "ยังมี %li รูปภาพที่รอซ่อมแซมอยู่ คุณแน่ใจหรือไม่ว่าต้องการหยุดซ่อมแซม?";
"There is still 1 video waiting to be repaired, are you sure you want to stop the repair?" = "ยังมี 1 วิดีโอที่รอซ่อมแซมอยู่ คุณแน่ใจหรือไม่ว่าต้องการหยุดซ่อมแซม?";
"There is still 1 photo waiting to be repaired, are you sure you want to stop the repair?" = "ยังมี 1 รูปภาพที่รอซ่อมแซมอยู่ คุณแน่ใจหรือไม่ว่าต้องการหยุดซ่อมแซม?";
"Are you sure you want to stop repairing?" = "คุณแน่ใจหรือไม่ว่าต้องการหยุดซ่อมแซม?";
"Repair done!" = "ซ่อมแซมเสร็จสิ้นแล้ว!";
"Repaired: %li files (%@)" = "ซ่อมแซมแล้ว: %li ไฟล์ (%@)";
"View Repair Results" = "ดูผลลัพธ์การซ่อมแซม";
"Export" = "ส่งออก";
"The video has been lost, please re-repair and try exporting again." = "วิดีโอหายไป โปรดซ่อมแซมใหม่แล้วลองส่งออกอีกครั้ง";
"The photo has been lost, please re-repair and try exporting again." = "รูปภาพหายไป โปรดซ่อมแซมใหม่แล้วลองส่งออกอีกครั้ง";
"The video has been lost, please re-import and try repairing again." = "วิดีโอหายไป โปรดนำเข้าใหม่แล้วลองซ่อมแซมอีกครั้ง";
"The photo has been lost, please re-import and try repairing again." = "รูปภาพหายไป โปรดนำเข้าใหม่แล้วลองซ่อมแซมอีกครั้ง";
"Selected: %li photo  (%@)" = "ที่เลือก: %li รูปภาพ (%@)";
"Selected: %li photos  (%@)" = "ที่เลือก: %li รูปภาพ (%@)";
"Selected: %li video  (%@)" = "ที่เลือก: %li วิดีโอ (%@)";
"Selected: %li videos  (%@)" = "ที่เลือก: %li วิดีโอ (%@)";
"%li Results" = "%li ผลลัพธ์";
"Close" = "ปิด";


"Match Similar Files" = "จับคู่ไฟล์ที่คล้ายคลึงกัน";
"We've found some files that might be what you want, you can preview and restore them." = "เราพบไฟล์บางอย่างที่อาจเป็นไฟล์ที่คุณต้องการ คุณสามารถพรีวิวและกู้คืนได้";
"Sorry, no matching files were found at this time. You can wait for the scan to finish and try again, or use Filter, Search Bar to find the files you want." = "ขออภัย ไม่พบไฟล์ที่ตรงกันในตอนนี้ คุณสามารถรอให้สแกนเสร็จแล้วรออีกครั้ง หรือใช้ตัวกรองและแถบค้นหาเพื่อหาไฟล์ที่คุณต้องการ";
"What Type of Files Do You Want to Recover?" = "คุณต้องการกู้คืนไฟล์ประเภทใด?";
"Filtering file type helps recover the files you want faster" = "การกรองประเภทไฟล์ช่วยกู้คืนไฟล์ที่คุณต้องการได้รวดเร็วยิ่งขึ้น";
"Others" = "อื่นๆ";
"Other Types" = "ประเภทอื่นๆ";
"%@ etc." = "%@ ฯลฯ";
"Scan Selected File Types" = "สแกนประเภทไฟล์ที่เลือก";
"Scan All File Types" = "สแกนไฟล์ทุกประเภท";
"Scan Only %@" = "สแกนเฉพาะ %@";


//MARK: - 预览
"Preview" = "ดูตัวอย่าง";
"Loading..." = "กำลังโหลด...";
"Preview is not available. Recover it for view" = "ดูตัวอย่างไม่ได้ กู้คืนมาให้ชมครับ";
"Max size for preview: 30MB. Recover it for view" = "ขนาดสูงสุดสำหรับการดูตัวอย่าง: 30MB กู้คืนมาให้ชมครับ";
"Format not supported for preview. Recover it for view" = "รูปแบบไม่รองรับการแสดงตัวอย่าง กู้คืนมาให้ชมครับ";
"%@ files zipped in total" = "จำนวนไฟล์ %@ ที่ถูกซิปทั้งหมด";
"AI Repairing..." = "AI ซ่อม...";
"It may take a while, but it's worth the wait" = "อาจใช้เวลาสักครู่ แต่ก็คุ้มค่ากับการรอ";
"AI Repaired %@" = "AI ซ่อมแซมแล้ว %@";
"Repaired successfully. Recover the repaired file" = "ซ่อมแซมได้สำเร็จ กู้คืนไฟล์ที่ซ่อมแซมแล้ว";
"Get Pro for Full Preview" = "รับ Pro เพื่อดูตัวอย่างแบบเต็ม";
"Preview full file" = "ดูตัวอย่างไฟล์แบบเต็ม";
"Recover unlimited files" = "กู้คืนไฟล์ได้ไม่จำกัด";
"AI Repair corrupte files" = "AI ซ่อมแซมไฟล์ที่เสียหาย";
"Premium technical support" = "การสนับสนุนทางเทคนิคระดับพรีเมียม";
"Get Pro Now" = "รับโปรทันที";
"Details" = "รายละเอียด";
"Icon" = "ไอคอน";


//MARK: - 付费升级弹窗
"Get Pro for Unlimited Recovery" = "รับเวอร์ชัน Pro และเพลิดเพลินกับการกู้คืนแบบไม่จำกัด";
"Preview only." = "สามารถดูตัวอย่างได้เท่านั้น";
"No free recovery remaining." = "ไม่มีจำนวนเงินกู้คืนฟรี";
"Unlock Pro to enjoy full features, unlimited recovery and more benefits." = "ปลดล็อคเวอร์ชัน Pro เพื่อเพลิดเพลินกับฟีเจอร์ทั้งหมด การกู้คืนไม่จำกัด และอื่นๆ อีกมากมาย";
"Get Pro for Unlimited Repair" = "รับเวอร์ชันโปรและเพลิดเพลินกับการแก้ไขไม่จำกัด";
"Unlock Pro to enjoy full features, unlimited repair and more benefits." = "ปลดล็อกเวอร์ชัน Pro เพื่อเพลิดเพลินกับฟีเจอร์ทั้งหมด การแก้ไขแบบไม่จำกัด และอื่นๆ อีกมากมาย";
"Trial" = "เวอร์ชั่นทดลอง";
"Free" = "รุ่นฟรี";
"Pro" = "รุ่นมืออาชีพ";
"Preview only" = "สามารถดูตัวอย่างเท่านั้น";
"Unlimited" = "ไม่มีขีด จำกัด";
"Key Features & Benefits" = "หน้าที่หลักและคุณประโยชน์";
"Recovery amount" = "จำนวนการกู้คืน";
"Preview before recovery" = "ดูตัวอย่างก่อนการกู้คืน";
"Recover while scanning" = "สแกนเพื่อการกู้คืน";
"Recover data from crashed system" = "กู้คืนข้อมูลจากระบบที่เสียหาย";
"Recover data from NAS server" = "กู้คืนข้อมูลจากเซิร์ฟเวอร์ NAS";
"Repair corrupted vidoes & photos" = "ซ่อมแซมวิดีโอและภาพที่เสียหาย";
"Enjoy lifetime updates for free" = "เพลิดเพลินกับการอัปเกรดผลิตภัณฑ์ฟรีตลอดอายุการใช้งาน";
"24/7 premium technical support" = "การสนับสนุนลูกค้าขั้นสูงตลอด 24/7 ชั่วโมง";
"30-day money back guarantee" = "รับประกันคืนเงินสินค้าภายใน 30 วัน";
"Buy Now" = "ซื้อเลย";
"Already Purchased?" = "ฉันซื้อแล้วหรือยัง?";
"Register Now to proceed with recovering ( no need to rescan)." = "ลงทะเบียนตอนนี้เพื่อดำเนินการกู้คืนต่อ (ไม่จำเป็นต้องสแกนซ้ำ)";
"Register Now" = "ลงทะเบียนตอนนี้";
"Recover the repaired file" = "กู้คืนไฟล์ที่ซ่อมแซมแล้ว";
"Recover it for view" = "กู้คืนมาให้ชมครับ";

//MARK: - 5.1.8
"Lost data recovery" = "การกู้คืนข้อมูลที่สูญหาย";
"Hard Drive" = "ฮาร์ดไดรฟ์";
"Advanced recovery" = "การกู้คืนขั้นสูง";
"Crashed Mac" = "Mac พัง";
"iCloud" = "iCloud";
"New" = "ใหม่";
"Corrupted file repair" = "การซ่อมแซมไฟล์ที่เสียหาย";
"Photo Repair" = "ซ่อมภาพ";
"Video Repair" = "ซ่อมวิดีโอ";
"Why Pro？" = "ทำไมต้องโปร?";
"Unlock Pro to enjoy" = "ปลดล็อค Pro เพื่อเพลิดเพลิน";
"Unlimited Recovery" = "การกู้คืนไม่จำกัด";
"Corrupted Repair" = "การซ่อมแซมที่เสียหาย";
"Full Preview" = "ดูตัวอย่างแบบเต็ม";
"Unlock Pro Now" = "ปลดล็อค Pro ทันที";
"Recover permanently & recently deleted iCloud data easily" = "กู้คืนข้อมูล iCloud ที่ถูกลบอย่างถาวร & ล่าสุดได้อย่างง่ายดาย";
"Recover any lost photos, videos, contacts, notes and more from iCloud directly" = "กู้คืนรูปภาพ วิดีโอ ผู้ติดต่อ บันทึก และอื่นๆ ที่สูญหายจาก iCloud โดยตรง";
"Get Started" = "เริ่ม";
"Searching lost iCloud data..." = "กำลังค้นหาข้อมูล iCloud ที่สูญหาย...";
"Search Completed" = "ค้นหาเสร็จสิ้น";
"Search Stopped" = "การค้นหาหยุดแล้ว";
"Damaged or partitially missing photos" = "ภาพถ่ายเสียหายหรือหายไปบางส่วน";
"Add photos for repair" = "เพิ่มรูปถ่ายเพื่อการซ่อมแซม";
"Corrupted or unplayable vidoes" = "วิดีโอเสียหายหรือเล่นไม่ได้";
"Add videos for repair" = "เพิ่มวิดีโอสำหรับการซ่อมแซม";
"Repair any damaged or photos that cannot be opened" = "ซ่อมแซมไฟล์รูปภาพที่เสียหายหรือไม่สามารถเล่นได้ และอื่นๆ";
"Repair any corrupted or unplayale videos files and more" = "ซ่อมแซมไฟล์วิดีโอที่เสียหายหรือเล่นไม่ได้และอื่นๆ อีกมากมาย";
//MARK: - v5.1.10
"Sign in to iCloud" = "ลงชื่อเข้าใช้ iCloud";
"Apple ID" = "Apple ID";
"Password" = "รหัสผ่าน";
"Keep Password" = "เก็บรหัสผ่าน";
"Forget Apple ID or Password?" = "ลืม Apple ID หรือรหัสผ่าน?";
"Back" = "กลับ";
"Log In" = "เข้าสู่ระบบ";
"1. To prevent changes to iCloud, do not sync device data to iCloud while recovering." = "1. เพื่อป้องกันการเปลี่ยนแปลงกับ iCloud อย่าซิงค์ข้อมูลอุปกรณ์กับ iCloud ขณะกำลังกู้คืน";
"2. We NEVER keep records of your account. For more details, please refer to our Privacy Policy." = "2. เราจะไม่เก็บบันทึกบัญชีของคุณ สำหรับรายละเอียดเพิ่มเติม โปรดดูนโยบายความเป็นส่วนตัวของเรา";
"Privacy Policy" = "นโยบายความเป็นส่วนตัว";
"Incorrect Apple ID or password." = "Apple ID หรือรหัสผ่านไม่ถูกต้อง";
"For security reasons, your Apple ID is locked. Please unlock your account and try again." = "ด้วยเหตุผลด้านความปลอดภัย Apple ID ของคุณจึงถูกล็อค โปรดปลดล็อคบัญชีของคุณแล้วลองอีกครั้ง";
"Network disconnected. Please check your network connection and try again." = "เครือข่ายถูกตัดการเชื่อมต่อ โปรดตรวจสอบการเชื่อมต่อเครือข่ายของคุณแล้วลองอีกครั้ง";
"Two-factor authentication" = "การรับรองความถูกต้องด้วยสองปัจจัย";
"A verification code message has been sent to your trusted device. Please enter the code to continue." = "ข้อความรหัสยืนยันได้ถูกส่งไปยังอุปกรณ์ที่เชื่อถือได้ของคุณแล้ว กรุณากรอกรหัสเพื่อดำเนินการต่อ";
"Resend code" = "ส่งรหัสอีกครั้ง";
"Get Help from Apple" = "รับความช่วยเหลือจาก Apple";
"Incorrect verification code." = "รหัสยืนยันไม่ถูกต้อง";
"Entered incorrect verification code too many times." = "ป้อนรหัสยืนยันไม่ถูกต้องหลายครั้งเกินไป";
"Request failed, please try again." = "คำขอล้มเหลว โปรดลองอีกครั้ง";
"Verification requested too often" = "ขอการยืนยันบ่อยเกินไป";
"Network error. Please check your network connection." = "ข้อผิดพลาดของเครือข่าย โปรดตรวจสอบการเชื่อมต่อเครือข่ายของคุณ";
"Please select the type of data you want to recover." = "โปรดเลือกประเภทข้อมูลที่คุณต้องการกู้คืน";
"Log Out" = "ออกจากระบบ";
"Select all" = "เลือกทั้งหมด";
"Refresh" = "รีเฟรช";
"Back" = "กลับ";
"Confirm" = "ยืนยัน";
"iCloud drive" = "ไดรฟ์ไอคราว";
"Photos" = "ภาพถ่าย";
"Contacts" = "รายชื่อผู้ติดต่อ";
"Reminder" = "คำเตือน";
"Calendar" = "ปฏิทิน";
"Notes" = "หมายเหตุ";
//MARK: - 4ddig mac 5.1.10
"Home Phone" = "เลขที่บ้าน";
"Work" = "หมายเลขงาน";
"iPhone" = "หมายเลขไอโฟน";
"Mobile Phone" = "หมายเลขโทรศัพท์มือถือ";
"Main Phone" = "หมายเลขหลัก";
"HomeFax" = "หมายเลขแฟกซ์ที่อยู่อาศัย";
"WorkFax" = "แฟกซ์ที่ทำงาน";
"Pager Phone" = "เสียงบี๊บเพจเจอร์";
"Other Phone" = "หมายเลขอื่นๆ";
"Home Email" = "อีเมลครอบครัว";
"Work Email" = "อีเมล์ที่ทำงาน";
"Other Email" = "อีเมล์อื่นๆ";
"iCloud Email" = "อีเมล์ไอคราว";
"HomePage" = "หน้าแรก";
"Home Page" = "หน้าครอบครัว";
"Other Page" = "หน้างาน";
"Work Page" = "หน้าอื่น";
"Title" = "ชื่อ";
"Starting Time" = "เวลาเริ่มต้น";
"List" = "รายการ";
"Status" = "สถานะ";
"Reminder time" = "เวลาเตือนความจำ";
"Priority" = "ลำดับความสำคัญ";
"Location" = "ที่ตั้ง";
//MARK: - 第二批_3.21
"Company" = "บริษัท";
"School" = "โรงเรียน";
"Time" = "เวลา";
"End Date Time" = "วันที่สิ้นสุด เวลา";
"Complete" = "สมบูรณ์";
"Incomplete" = "ไม่สมบูรณ์";
"Invited People" = "คนที่ได้รับเชิญ";
"Flag Marks" = "เครื่องหมายธง";
"None" = "ไม่มี";
"Low" = "ต่ำ";
"Medium" = "ปานกลาง";
"High" = "สูง";
"Unknown" = "ไม่ทราบ";
//MARK: - 5.1.11
"Unsaved Documents" = "ไฟล์ที่ไม่ได้บันทึก";
"Date Deleted" = "วันที่ถูกลบ";
//MARK: - PE
"Crashed Mac" = "แมคพัง";
"Create a bootable drive to boot up Mac for data recovery" = "สร้างไดรฟ์ที่สามารถบู๊ตได้เพื่อบู๊ตเครื่อง Mac สำหรับการกู้คืนข้อมูล";
"What's Crashed Mac？" = "Crashed Mac คืออะไร？";
"Boot up Mac with the USB bootable drive for data recovery" = "บูตเครื่อง Mac ด้วยไดรฟ์ USB ที่สามารถบูตได้สำหรับการกู้คืนข้อมูล";
"Boot up crashed Mac" = "บูตเครื่อง Mac ที่เสียหาย";
"Tips: please try again with another USB drive Common Solutions" = "เคล็ดลับ: โปรดลองอีกครั้งโดยใช้ไดรฟ์ USB อื่น วิธีแก้ไขปัญหาทั่วไป";
"Common Solutions" = "โซลูชั่นทั่วไป";
"Icon" = "ไอคอน";
"Preview Pane" = "บานหน้าต่างแสดงตัวอย่าง";
"Details" = "รายละเอียด";
"Create Now" = "สร้างตอนนี้";
"Lost Partition" = "พาร์ติชั่นที่หายไป";

"Select a drive where you lost data to start recovering" = "เลือกไดรฟ์ที่คุณสูญเสียข้อมูลเพื่อเริ่มการกู้คืน";
"Drive didn't show up?" = "ไดรฟ์ไม่ปรากฏขึ้น?";
"Check Disk Connection" = "ตรวจสอบการเชื่อมต่อดิสก์";
"To recover data from digital camera, please remove the SD card and connect it to Mac via card reader." = "หากต้องการกู้คืนข้อมูลจากกล้องดิจิตอล โปรดถอดการ์ด SD ออกและเชื่อมต่อกับ Mac ผ่านทางเครื่องอ่านการ์ด";
"When the USB device cannot be recognized, please try to connnect it to the back USB ports for data recovery." = "เมื่อไม่รู้จักอุปกรณ์ USB โปรดลองเชื่อมต่อกับพอร์ต USB ด้านหลังเพื่อการกู้คืนข้อมูล";
"For data recovery from mobile phones, you can download UltData - iOS." = "สำหรับการกู้คืนข้อมูลจากโทรศัพท์มือถือ คุณสามารถดาวน์โหลด UltData - iOS ได้";
"Check Disk Status" = "ตรวจสอบสถานะดิสก์";
"Solution: Access Disk Utility, click the \"Mount\" button on the top menu bar, and then recover your data." = "วิธีแก้ไข: เข้าถึง ยูทิลิตี้ดิสก์คลิกปุ่ม \"Mount\" บนแถบเมนูด้านบน จากนั้นกู้คืนข้อมูลของคุณ";
"Language_menu" = "ภาษา";
"Disk Utility" = "ยูทิลิตี้ดิสก์";
"Mount" = "ภูเขา";
"1. Access \"Disk Utility\"" = "1. เข้าถึง \"ยูทิลิตี้ดิสก์\"";
"2. Click \"Mount\"" = "2. คลิก \"ภูเขา\"";

//MARK: - V5.1.18
"Select a location to save the recovered data" = "เลือกตำแหน่งที่จะบันทึกข้อมูลที่กู้คืน";
"You've selected %li files, %@" = "คุณได้เลือกไฟล์ %li, %@";
"%@ available" = "%@ ใช้ได้";
"Perfectly enough disk space. Save now." = "พื้นที่ดิสก์เพียงพออย่างสมบูรณ์ บันทึกในขณะนี้.";
"Save to the %@ and you don’t have to worry about data loss anymore." = "บันทึกลงใน %@ และคุณไม่ต้องกังวลว่าข้อมูลจะสูญหายอีกต่อไป";
"Save Now" = "บันทึกในขณะนี้";
"Insufficient space available, change another location or save to the %@." = "พื้นที่ว่างไม่เพียงพอ เปลี่ยนสถานที่อื่นหรือบันทึกลงใน %@";
"It is not recommended to save to the original disk (where the data is lost), as it may have the data to be overwritten and lost permanently." = "ไม่แนะนำให้บันทึกลงในดิสก์ต้นฉบับ (ในกรณีที่ข้อมูลสูญหาย) เนื่องจากอาจมีข้อมูลที่ต้องถูกเขียนทับและสูญหายอย่างถาวร";
"No permissions to read or write, change another location or save to the %@." = "ไม่มีสิทธิ์ในการอ่านหรือเขียน เปลี่ยนสถานที่อื่น หรือบันทึกลงใน %@";
"Insufficient space available in %@. Please change to another location to save." = "พื้นที่ว่างไม่เพียงพอใน %@ โปรดเปลี่ยนเป็นตำแหน่งอื่นเพื่อบันทึก";
"Select Folder..." = "เลือกโฟลเดอร์...";
"Logging in..." = "กำลังเข้าสู่ระบบ...";
"Please authorize login to your %@ in the browser" = "โปรดอนุญาตการเข้าสู่ระบบ %@ ของคุณในเบราว์เซอร์";
"Authorization login failed" = "การเข้าสู่ระบบการให้สิทธิ์ล้มเหลว";
"Please re-authorize or change to another location" = "โปรดอนุญาตอีกครั้งหรือเปลี่ยนแปลงไปยังสถานที่อื่น";
"Another Location" = "สถานที่อื่น";
"Re-authorize" = "อนุญาตอีกครั้ง";
"Authorization successful. Please return to %@ to continue recovering data." = "การอนุญาตสำเร็จ โปรดกลับไปที่ %@ เพื่อดำเนินการกู้คืนข้อมูลต่อไป";

//MARK: - V5.2.0
"Large & Old Files" = "ไฟล์ขนาดใหญ่และเก่า";
"Locate and remove unneeded files to free up disk space with ease" = "ค้นหาและลบไฟล์ที่ไม่จำเป็นเพื่อเพิ่มพื้นที่ว่างในดิสก์ได้อย่างง่ายดาย";
"Locate Files in Minutes" = "ค้นหาไฟล์ในไม่กี่นาที";
"Finding large or old files manually could take you hours, but with %@ you’ll be done within minutes." = "การค้นหาไฟล์ขนาดใหญ่หรือเก่าด้วยตนเองอาจใช้เวลาหลายชั่วโมง แต่ด้วย %@ คุณจะเสร็จสิ้นภายในไม่กี่นาที";
"Remove As You Wish" = "ลบตามที่คุณต้องการ";
"Remove unneeded files to trash, another folder or permanently. It's always your call." = "ลบไฟล์ที่ไม่จำเป็นลงถังขยะ โฟลเดอร์อื่น หรือลบถาวร มันเป็นสายของคุณเสมอ";
"%@ used" = "%@ ใช้แล้ว";
"Scan Now" = "ตรวจเดี๋ยวนี้";
"All Files" = "เอกสารทั้งหมด";
"Selected" = "เลือกแล้ว";
"By Size" = "ตามขนาด";
"By Access Date" = "ตามวันที่เข้าถึง";
"Last Week" = "อาทิตย์ที่แล้ว";
"Last Month" = "เดือนที่แล้ว";
"Scanning %@" = "กำลังสแกน %@";
"Looking for large & old files" = "ค้นหาไฟล์ขนาดใหญ่และเก่า";
"Stop Scanning" = "หยุดการสแกน";
"No files found" = "ไม่พบไฟล์";
"Return to home and select another location to start over" = "กลับบ้านและเลือกสถานที่อื่นเพื่อเริ่มต้นใหม่";
"Removing: %@" = "การถอด:%@";
"It may take some time..." = "อาจต้องใช้เวลาบ้าง...";
"Remove Completed" = "ลบเสร็จแล้ว";
"Removed: %li files (%@)" = "ลบออก: ไฟล์ %li (%@)";
"Done" = "เสร็จแล้ว";
"Insufficient permissions to remove" = "สิทธิ์ไม่เพียงพอที่จะลบ";
"No read/write permissions for NTFS partition, and it cannot be removed." = "ไม่มีสิทธิ์ในการอ่าน/เขียนสำหรับพาร์ติชัน NTFS และไม่สามารถลบออกได้";
"Insufficient space at target folder to remove" = "มีพื้นที่ไม่เพียงพอในโฟลเดอร์เป้าหมายที่จะลบ";
"Remove to another folder or remove permanently." = "ลบไปยังโฟลเดอร์อื่นหรือลบออกอย่างถาวร";
"No files selected" = "ไม่ได้เลือกไฟล์";
"Remove Permanently" = "ลบออกอย่างถาวร";
"Remove to Trash" = "ลบลงถังขยะ";
"Remove to Folder" = "ลบไปที่โฟลเดอร์";
"Access Time" = "เวลาเข้าใช้งาน";
"Open File Location" = "เปิดตำแหน่งไฟล์";
"Return to home?" = "กลับบ้าน?";
"It is recommended to remove unwanted files before you return." = "ขอแนะนำให้ลบไฟล์ที่ไม่ต้องการออกก่อนที่จะกลับมา";
"Return" = "กลับ";
"Cancel" = "ยกเลิก";
"Stop Scanning?" = "หยุดการสแกนใช่ไหม";
"%@ will be no longer looking for large & old files if you stop." = "%@ จะไม่ค้นหาไฟล์ขนาดใหญ่และเก่าอีกต่อไปหากคุณหยุด";
"Stop Scanning" = "หยุดการสแกน";
"Stop Removing?" = "หยุดการลบ?";
"%@ will be no longer removing files remaining if you stop." = "%@ จะไม่ลบไฟล์ที่เหลืออีกต่อไปหากคุณหยุด";
"Stop Removing" = "หยุดการถอด";
"Get Pro for Files Removal" = "รับ Pro สำหรับการลบไฟล์";
"Unlock Pro to remove unwanted large & old files, and enjoy more features, including unlimited data recovery." = "ปลดล็อค Pro เพื่อลบไฟล์ขนาดใหญ่และเก่าที่ไม่ต้องการ และเพลิดเพลินกับคุณสมบัติเพิ่มเติม รวมถึงการกู้คืนข้อมูลไม่จำกัด";
"Files available for removal" = "ไฟล์ที่สามารถลบได้";
"Authorizing for %@, please wait..." = "กำลังให้สิทธิ์สำหรับ %@ โปรดรอสักครู่...";
"Calculating the available space in %@, please wait..." = "กำลังคำนวณพื้นที่ว่างใน %@ โปรดรอสักครู่...";
//MARK: - 第二批_20240626
"Extra tools" = "เครื่องมือเสริม";
"Sort by %@" = "เรียงตาม%@";
"By Modified Date" = "โดยวันที่แก้ไข";
//MARK: - 2. SD卡
"SD Card" = "การ์ดเอสดี";
"Select a memory card where you lost data to start recovering" = "เลือกการ์ดหน่วยความจำที่คุณสูญเสียข้อมูลเพื่อเริ่มการกู้คืน";
"SD card didn't show up?" = "การ์ด SD ไม่แสดงขึ้นมา?";
"No SD card connected" = "ไม่ได้เชื่อมต่อการ์ด SD";
"Connect the memory card via card reader to start recovering photos or videos" = "เชื่อมต่อการ์ดหน่วยความจำผ่านเครื่องอ่านการ์ดเพื่อเริ่มการกู้คืนรูปภาพหรือวิดีโอ";
//MARK: - 视频重组
"Enhanced Video Recovery" = "การกู้คืนวิดีโอขั้นสูง";
"Scan and match video fragments in any storage media through AI advanced algorithms to recover a complete and playable video" = "สแกนและจับคู่ส่วนย่อยของวิดีโอในสื่อจัดเก็บข้อมูลใดๆ ผ่านอัลกอริธึมขั้นสูงของ AI เพื่อกู้คืนวิดีโอที่สมบูรณ์และสามารถเล่นได้";
"Repair & recover vidoes at the same time, providing one-stop video solution" = "ซ่อมแซมและกู้คืนวิดีโอในเวลาเดียวกัน โดยให้บริการโซลูชันวิดีโอแบบครบวงจร";
"Easily recover & repair videos from any devices, such as Canon, Nikon, Sony, GoPro, and DJI, etc. Learn more" = "กู้คืนและซ่อมแซมวิดีโอได้อย่างง่ายดายจากอุปกรณ์ใดๆ เช่น Canon, Nikon, Sony, GoPro และ DJI ฯลฯ เรียนรู้เพิ่มเติม";
"AI-Powered" = "ขับเคลื่อนด้วย AI";
"Mac OS 10.15 previous versions are not supported" = "ไม่รองรับ Mac OS 10.15 เวอร์ชันก่อนหน้า";
"Try 'Enhanced Video Recovery' with Mac OS 10.15 or later" = "ลองใช้ 'Enhanced Video Recovery' กับ Mac OS 10.15 หรือใหม่กว่า";
"Select a drive where you lost vidoes to start recovering" = "เลือกไดรฟ์ที่คุณสูญเสียวิดีโอเพื่อเริ่มการกู้คืน";
"Tips: Don't know which drive to scan, as you're not sure where the vidoe was lost?" = "เคล็ดลับ: ไม่รู้ว่าต้องสแกนไดรฟ์ตัวไหน เนื่องจากคุณไม่แน่ใจว่าวิดีโอหายไปที่ไหน";
"Select the video format you want to recover" = "เลือกรูปแบบวิดีโอที่คุณต้องการกู้คืน";
"All videos" = "วิดีโอทั้งหมด";
"Recovery duration: The more video types selected, the longer it will take." = "ระยะเวลาการกู้คืน: ยิ่งเลือกประเภทวิดีโอมากเท่าไร ก็ยิ่งใช้เวลานานขึ้นเท่านั้น";
"Device that the vidoes are from (optional)" = "อุปกรณ์ที่มาจากวิดีโอ (ตัวเลือก)";
"Note: correct source device contributes to the targeted and precise recovery, significantly improving the recovery quality." = "หมายเหตุ: อุปกรณ์ต้นทางที่ถูกต้องมีส่วนช่วยในการกู้คืนที่ตรงเป้าหมายและแม่นยำ ซึ่งช่วยปรับปรุงคุณภาพการกู้คืนได้อย่างมาก";
"Confirm" = "ยืนยัน";
"Canon" = "Canon";
"GoPro" = "GoPro";
"Nikon" = "Nikon";
"Sony" = "Sony";
"Fujifilm" = "Fujifilm";
"DJI" = "DJI";
"Apeman" = "Apeman";
"Papago" = "Papago";
"Vantrue" = "Vantrue";
"Rexing" = "Rexing";
"Others" = "อื่น";
"Please select at least one video format for enhanced video recovery" = "โปรดเลือกรูปแบบวิดีโออย่างน้อยหนึ่งรูปแบบสำหรับการกู้คืนวิดีโอขั้นสูง";
"Select All" = "เลือกทั้งหมด";
"AI" = "AI";
"Video enhanced recovering...some black screen and unplayable vidoes could be repaired by AI once it completes." = "การกู้คืนวิดีโอที่ได้รับการปรับปรุง...หน้าจอสีดำและวิดีโอที่ไม่สามารถเล่นได้บางส่วนสามารถซ่อมแซมได้โดย AI เมื่อเสร็จสิ้น";
"Learn more" = "เรียนรู้เพิ่มเติม";
